a1 = [1,1,3,4,5,5,6,7]
b1= [3,4,2,2,1,7,8,9]
c1 = ['a','b','c','d','e','f','g','h']
d1 = ['a','a','c','s','g','h','l','s','b']
print ('------------------------------------------------------------')
formula1 = [x*y for x in a1 for y in b1]#列表推导式
print (formula1)
print ('------------------------------------------------------------')
formula2 = {x:y for x in c1 for y in a1}#字典推导式式{(key):(value) ........}
print (formula2)
print ('------------------------------------------------------------')
formula3 = {x for x in d1 if x not in 'abc'}#集合推导式{exp_ for ........}
print (formula3)
print ('------------------------------------------------------------')
formula4 = (x for x in a1)
print (formula4)
print (type(formula4))
print ('------------------------------------------------------------')