#元组的元素不可修改
#元组可以进行拼接操作(运算符，迭代)
#元组通过下标访问
#元组可以整个删除

tup0 = ()   #创建空元组
tup1 = (2,) #创建一个元素的元组需要加上逗号，否则括号会被识别为运算符
tup2 = (1,2,3,4)
tup3 = (5,6,7,8)
tup4 = tup2 + tup3#运算符进行拼接，倍增
tup5 = tup2 * 2
list0 = [9,10,11,12]
tup6 = tuple(list0)
print (tup5)
print ('------------------------------------------------------------')
print (tup4)
print ('------------------------------------------------------------')
print (tup4[1:7])#通过下标访问
print ('------------------------------------------------------------')
print (tup4[-1])
print ('------------------------------------------------------------')
del tup0    #删除元组
#print (tup0)#Error
print (len(tup4))#length
print ('------------------------------------------------------------')
print (max(tup4))#max
print ('------------------------------------------------------------')
print (min(tup4))#minium
print ('------------------------------------------------------------')
print(tup6)